In [57]:
import pandas as pd

In [58]:
dataframe=pd.read_csv("121.csv")

In [59]:
dataframe

    Book   p1   p2 p3   p4 p5   p6 p7   p8
0  book1  3.5    2  5    3  -    -  5    3
1  book2    2  3.5  1    4  4  4.5  2    -
2  book3    -    4  1  4.5  1    4  -    -
3  book4  4.5    -  3    -  4    5  3    5
4  book5    5    2  5    3  -    5  5    4
5  book6  1.5  3.5  1  4.5  -  4.5  4  2.5
6  book7  2.5    -  -    4  4    4  5    3
7  book8    2    3  -    2  1    4  -    -

In [60]:
print(dataframe.columns)

Index(['Book', 'p1', 'p2', 'p3', 'p4', 'p5', 'p6', 'p7', 'p8'], dtype='object')

In [61]:
df=dataframe.replace('-',float("Nan"))

In [62]:
df

    Book   p1   p2   p3   p4   p5   p6   p7   p8
0  book1  3.5    2    5    3  NaN  NaN    5    3
1  book2    2  3.5    1    4    4  4.5    2  NaN
2  book3  NaN    4    1  4.5    1    4  NaN  NaN
3  book4  4.5  NaN    3  NaN    4    5    3    5
4  book5    5    2    5    3  NaN    5    5    4
5  book6  1.5  3.5    1  4.5  NaN  4.5    4  2.5
6  book7  2.5  NaN  NaN    4    4    4    5    3
7  book8    2    3  NaN    2    1    4  NaN  NaN

In [63]:
print(df.drop("p8",axis=1))

    Book   p1   p2   p3   p4   p5   p6   p7
0  book1  3.5    2    5    3  NaN  NaN    5
1  book2    2  3.5    1    4    4  4.5    2
2  book3  NaN    4    1  4.5    1    4  NaN
3  book4  4.5  NaN    3  NaN    4    5    3
4  book5    5    2    5    3  NaN    5    5
5  book6  1.5  3.5    1  4.5  NaN  4.5    4
6  book7  2.5  NaN  NaN    4    4    4    5
7  book8    2    3  NaN    2    1    4  NaN

In [64]:
df1=(df.drop(["p3","p4","p5","p6","p7","p8"],axis=1))

In [65]:
print(df1)

    Book   p1   p2
0  book1  3.5    2
1  book2    2  3.5
2  book3  NaN    4
3  book4  4.5  NaN
4  book5    5    2
5  book6  1.5  3.5
6  book7  2.5  NaN
7  book8    2    3

In [66]:
df2=df1[df1["p1"].notnull()]

In [67]:
df2

    Book   p1   p2
0  book1  3.5    2
1  book2    2  3.5
3  book4  4.5  NaN
4  book5    5    2
5  book6  1.5  3.5
6  book7  2.5  NaN
7  book8    2    3

In [68]:
df2=df2[df2["p2"].notnull()]

In [69]:
df2

    Book   p1   p2
0  book1  3.5    2
1  book2    2  3.5
4  book5    5    2
5  book6  1.5  3.5
7  book8    2    3

In [70]:
from scipy.spatial import distance

In [71]:
from scipy.spatial.distance import cityblock

In [72]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p2'].astype(float))

In [73]:
print(manhattanDistance)

9.0

In [74]:
manhattan=[]
manhattan.insert(1,manhattanDistance )
print(manhattan)

[9.0]

In [75]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p2'].astype(float))

In [76]:
print(euclideanDistance)

4.301162633521313

In [77]:
euclidean=[]

In [78]:

euclidean.insert(1,euclideanDistance )
print(euclidean)

[4.301162633521313]

In [79]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p2'].astype(float), p=4)

In [80]:
print(minkowskiDistance)

3.2246421772876928

In [81]:
minkowski=[]

In [82]:

minkowski.insert(1,minkowskiDistance )
print(minkowski)

[3.2246421772876928]

In [83]:
df1=(df.drop(["p2","p4","p5","p6","p7","p8"],axis=1))

In [84]:
df1

    Book   p1   p3
0  book1  3.5    5
1  book2    2    1
2  book3  NaN    1
3  book4  4.5    3
4  book5    5    5
5  book6  1.5    1
6  book7  2.5  NaN
7  book8    2  NaN

In [85]:
df2=df1[df1["p1"].notnull()]

In [86]:
df2

    Book   p1   p3
0  book1  3.5    5
1  book2    2    1
3  book4  4.5    3
4  book5    5    5
5  book6  1.5    1
6  book7  2.5  NaN
7  book8    2  NaN

In [87]:

df2=df2[df2["p3"].notnull()]

In [88]:
df2

    Book   p1 p3
0  book1  3.5  5
1  book2    2  1
3  book4  4.5  3
4  book5    5  5
5  book6  1.5  1

In [89]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p3'].astype(float))

In [90]:

manhattan.insert(2,manhattanDistance )
print(manhattan)

[9.0, 4.5]

In [91]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p3'].astype(float))

In [92]:
euclidean.insert(2,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596]

In [93]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p3'].astype(float),p=4)

In [94]:

minkowski.insert(2,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465]

In [95]:
df1=(df.drop(["p2","p3","p5","p6","p7","p8"],axis=1))

In [96]:
df1

    Book   p1   p4
0  book1  3.5    3
1  book2    2    4
2  book3  NaN  4.5
3  book4  4.5  NaN
4  book5    5    3
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    2

In [97]:
df2=df1[df1["p1"].notnull()]

In [98]:
df2

    Book   p1   p4
0  book1  3.5    3
1  book2    2    4
3  book4  4.5  NaN
4  book5    5    3
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    2

In [99]:
df2=df2[df2["p4"].notnull()]

In [100]:
df2

    Book   p1   p4
0  book1  3.5    3
1  book2    2    4
4  book5    5    3
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    2

In [103]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p4'].astype(float))

In [104]:

manhattan.insert(3,manhattanDistance )
print(manhattan)

[9.0, 4.5, 9.0]

In [105]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p4'].astype(float))

In [106]:

euclidean.insert(3,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596, 4.415880433163924]

In [107]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p4'].astype(float),p=4)

In [108]:

minkowski.insert(3,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465, 3.2967457529573125]

In [109]:
df1=(df.drop(["p2","p3","p4","p6","p7","p8"],axis=1))

In [110]:
df1

    Book   p1   p5
0  book1  3.5  NaN
1  book2    2    4
2  book3  NaN    1
3  book4  4.5    4
4  book5    5  NaN
5  book6  1.5  NaN
6  book7  2.5    4
7  book8    2    1

In [111]:
df2=df1[df1["p1"].notnull()]

In [112]:
df2

    Book   p1   p5
0  book1  3.5  NaN
1  book2    2    4
3  book4  4.5    4
4  book5    5  NaN
5  book6  1.5  NaN
6  book7  2.5    4
7  book8    2    1

In [113]:
df2=df2[df2["p5"].notnull()]

In [114]:
df2

    Book   p1 p5
1  book2    2  4
3  book4  4.5  4
6  book7  2.5  4
7  book8    2  1

In [116]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p5'].astype(float))

In [118]:

manhattan.insert(4,manhattanDistance )
print(manhattan)

[9.0, 4.5, 9.0, 5.0]

In [119]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p5'].astype(float))

In [120]:

euclidean.insert(4,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596, 4.415880433163924, 2.7386127875258306]

In [121]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p5'].astype(float),p=4)

In [122]:
 
minkowski.insert(4,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465, 3.2967457529573125, 2.1688065682666804]

In [123]:
df1=(df.drop(["p2","p3","p4","p5","p7","p8"],axis=1))

In [124]:
df1

    Book   p1   p6
0  book1  3.5  NaN
1  book2    2  4.5
2  book3  NaN    4
3  book4  4.5    5
4  book5    5    5
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    4

In [125]:
df2=df1[df1["p1"].notnull()]

In [126]:
df2

    Book   p1   p6
0  book1  3.5  NaN
1  book2    2  4.5
3  book4  4.5    5
4  book5    5    5
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    4

In [127]:
df2=df2[df2["p6"].notnull()]

In [128]:
df2

    Book   p1   p6
1  book2    2  4.5
3  book4  4.5    5
4  book5    5    5
5  book6  1.5  4.5
6  book7  2.5    4
7  book8    2    4

In [130]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p6'].astype(float))

In [131]:

manhattan.insert(5,manhattanDistance )
print(manhattan)

[9.0, 4.5, 9.0, 5.0, 9.5]

In [132]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p6'].astype(float))

In [133]:

euclidean.insert(5,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596, 4.415880433163924, 2.7386127875258306, 4.663689526544408]

In [134]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p6'].astype(float),p=4)

In [135]:

minkowski.insert(5,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465, 3.2967457529573125, 2.1688065682666804, 3.447061739846872]

In [136]:
df1=(df.drop(["p2","p3","p4","p5","p6","p8"],axis=1))

In [137]:
df1

    Book   p1   p7
0  book1  3.5    5
1  book2    2    2
2  book3  NaN  NaN
3  book4  4.5    3
4  book5    5    5
5  book6  1.5    4
6  book7  2.5    5
7  book8    2  NaN

In [138]:
df2=df1[df1["p1"].notnull()]

In [139]:
df2

    Book   p1   p7
0  book1  3.5    5
1  book2    2    2
3  book4  4.5    3
4  book5    5    5
5  book6  1.5    4
6  book7  2.5    5
7  book8    2  NaN

In [140]:
df2=df2[df2["p7"].notnull()]

In [141]:
df2

    Book   p1 p7
0  book1  3.5  5
1  book2    2  2
3  book4  4.5  3
4  book5    5  5
5  book6  1.5  4
6  book7  2.5  5

In [143]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p7'].astype(float))

In [144]:

manhattan.insert(6,manhattanDistance )
print(manhattan)

[9.0, 4.5, 9.0, 5.0, 9.5, 8.0]

In [145]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p7'].astype(float))

In [146]:

euclidean.insert(6,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596, 4.415880433163924, 2.7386127875258306, 4.663689526544408, 4.123105625617661]

In [147]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p7'].astype(float),p=4)

In [148]:

minkowski.insert(6,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465, 3.2967457529573125, 2.1688065682666804, 3.447061739846872, 3.0649872942686023]

In [149]:
df1=(df.drop(["p2","p3","p4","p5","p6","p7"],axis=1))

In [150]:
df1

    Book   p1   p8
0  book1  3.5    3
1  book2    2  NaN
2  book3  NaN  NaN
3  book4  4.5    5
4  book5    5    4
5  book6  1.5  2.5
6  book7  2.5    3
7  book8    2  NaN

In [151]:
df2=df1[df1["p1"].notnull()]

In [152]:
df2

    Book   p1   p8
0  book1  3.5    3
1  book2    2  NaN
3  book4  4.5    5
4  book5    5    4
5  book6  1.5  2.5
6  book7  2.5    3
7  book8    2  NaN

In [153]:
df2=df2[df2["p8"].notnull()]

In [154]:
df2

    Book   p1   p8
0  book1  3.5    3
3  book4  4.5    5
4  book5    5    4
5  book6  1.5  2.5
6  book7  2.5    3

In [155]:
manhattanDistance=distance.cityblock(df2['p1'].astype(float),df2['p8'].astype(float))

In [156]:

manhattan.insert(7,manhattanDistance )
print(manhattan)

[9.0, 4.5, 9.0, 5.0, 9.5, 8.0, 3.5]

In [157]:
euclideanDistance=distance.euclidean(df2['p1'].astype(float),df2['p8'].astype(float))

In [158]:

euclidean.insert(7,euclideanDistance )
print(euclidean)

[4.301162633521313, 2.3979157616563596, 4.415880433163924, 2.7386127875258306, 4.663689526544408, 4.123105625617661, 1.6583123951777]

In [159]:
minkowskiDistance=distance.minkowski(df2['p1'].astype(float),df2['p8'].astype(float),p=4)

In [160]:

minkowski.insert(7,minkowskiDistance )
print(minkowski)

[3.2246421772876928, 1.8288717943215465, 3.2967457529573125, 2.1688065682666804, 3.447061739846872, 3.0649872942686023, 1.2161496395488938]

In [161]:

dict  = { "Manhattan":manhattan,"Euclidean":euclidean,"Minkowski":minkowski};

In [162]:
table= pd.DataFrame(dict)

In [164]:
print(table)

   Manhattan  Euclidean  Minkowski
0        9.0   4.301163   3.224642
1        4.5   2.397916   1.828872
2        9.0   4.415880   3.296746
3        5.0   2.738613   2.168807
4        9.5   4.663690   3.447062
5        8.0   4.123106   3.064987
6        3.5   1.658312   1.216150